# Title     : TODO
# Objective : TODO
# Created by: Ilya
# Created on: 10/30/2020

# Title     : Практические задания
# Objective : Практика
# Created by: Ilya
# Created on: 10/30/2020


# TODO Проблема 1. Сложите все числа на промежутке от 0 до 100



# TODO Проблема 2. Сгенерируйте следующую последовательность: (-9, -6, ... 24, 27, 28)
#  и разделите на среднее значение не используя `mean`


# TODO Проблема 3. Вам даны два вектора `a` и `b` найдите их сумму, разницу, произведение, отношение и возведите один в степень другого
a <- c(10, 9, 8, 7)
b <- c(-2, 1, 2, 3)


# TODO Проблема 4. Используя только `rep` `c` сгенерировать последовательность следующего вида
#  0.0101, 0.0102, 0.0103, 0.1010, 0.1020, 0.1030 ... 101.0000, 102.0000, 103.0000
#  и зная тот факт, что 10^(0, 2) равно (1, 10, 100)


# TODO Проблема 5. Дана матрица m. Выберите элементы из всех строк и первой и последней колонки. Решения должно работать
# для матриц любого размера
m <- matrix(1:30, nrow = 5, ncol = 6)

# TODO Проблема 6. Выберите элементы из первой и последней строки, а также все колонки не включая пятую


# TODO Проблема 7. Выберите все значения стоящие в четных колонках и нечетных строках


# TODO Проблема 8. Выберите только четные значения


# TODO Проблема 9. Создайте вектор выделите первые 3 элемента и последние 2


# TODO Проблема 10. Удалите элементы из вектора


# TODO Проблема 11. Запишите ответ без использования R.
#  (TRUE & TRUE) | FALSE
#  (TRUE & FALSE) | FALSE
#  (FALSE | FALSE) | FALSE
#  (!FALSE) | FALSE | FALSE
#  (!FALSE) | FALSE & TRUE

# TODO Проблема 12. Создайте матрицу из двух веторов расположив их построчно
a <- 1:3
b <- 4:6


# TODO Проблема 13. Распечатайте полученную матрицу с помощью цикла for


# TODO Проблема 14. Суммируйте числа, пока сумма не превысит заданный порог


# TODO Проблема 15. solve

